eksan99/Smart_Medicine_Box_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define hatch_Pin GPIO_PIN_13
#define hatch_GPIO_Port GPIOC
#define Pump_Pin GPIO_PIN_14
#define Pump_GPIO_Port GPIOC
#define Pump_open_Pin GPIO_PIN_15
#define Pump_open_GPIO_Port GPIOC
#define Pump_close_Pin GPIO_PIN_0
#define Pump_close_GPIO_Port GPIOA
#define DIR_M1_Pin GPIO_PIN_1
#define DIR_M1_GPIO_Port GPIOA
#define DIR_M2_Pin GPIO_PIN_4
#define DIR_M2_GPIO_Port GPIOA
#define ENA_M5_Pin GPIO_PIN_5
#define ENA_M5_GPIO_Port GPIOA
#define DIR_M5_Pin GPIO_PIN_7
#define DIR_M5_GPIO_Port GPIOA
#define DIR_M3_Pin GPIO_PIN_0
#define DIR_M3_GPIO_Port GPIOB
#define DIR_M4_Pin GPIO_PIN_1
#define DIR_M4_GPIO_Port GPIOB
#define Sensor_5_Pin GPIO_PIN_11
#define Sensor_5_GPIO_Port GPIOB
#define Sensor_1_Pin GPIO_PIN_12
#define Sensor_1_GPIO_Port GPIOB
#define Sensor_2_Pin GPIO_PIN_13
#define Sensor_2_GPIO_Port GPIOB
#define Sensor_3_Pin GPIO_PIN_14
#define Sensor_3_GPIO_Port GPIOB
#define Sensor_4_Pin GPIO_PIN_15
#define Sensor_4_GPIO_Port GPIOB
#define LED_Pin GPIO_PIN_12
#define LED_GPIO_Port GPIOA
#define ENA_M4_Pin GPIO_PIN_4
#define ENA_M4_GPIO_Port GPIOB
#define ENA_M3_Pin GPIO_PIN_5
#define ENA_M3_GPIO_Port GPIOB
#define ENA_M2_Pin GPIO_PIN_8
#define ENA_M2_GPIO_Port GPIOB
#define ENA_M1_Pin GPIO_PIN_9
#define ENA_M1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
